# 1. Importing numpy and pandas dictionaries

<a id='start_of_the_page'>a</a>

In [73]:
import numpy as np
import pandas as pd

In [74]:
pwd

'/Users/ayubpathan/Desktop/ironhack/Week2/Project-Week-2-Barcelona'

# 2. Reading csv file 
##      Calling first 5 rows

In [75]:
baby_name = pd.read_csv("/Users/ayubpathan/Desktop/ironhack/Week2/Project-Week-2-Barcelona/datasets/3.-Population/most-frequent-baby-names.csv")
baby_name_new = baby_name.copy() # copying original files to baby_name_new


baby_name.head()

   Order    Name  Gender  Year  Frequency
0      1   LAURA  Female  1996        237
1      2   MARIA  Female  1996        219
2      3   MARTA  Female  1996        206
3      4  ANDREA  Female  1996        199
4      5    ANNA  Female  1996        195

In [76]:
baby_name.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Order      1050 non-null   int64
 1   Name       1050 non-null   object
 2   Gender     1050 non-null   object
 3   Year       1050 non-null   int64
 4   Frequency  1050 non-null   int64
dtypes: int64(3), object(2)
memory usage: 41.1+ KB

In [77]:
baby_name.shape

(1050, 5)

# 3. Data analysis task:  
-  Check if we have duplicates values in rows : we sum them up to get the total frequency out of them then we go to compare top 10 names for  
   male and female from df 
- Top 3 names from each year - with highest frequency in each year 
- Frequency/counts name comparison of male and female
- International vs Local names for both cases; male & female
- Checking total counts for names starting with A,D, E
- Preferred shortest & longest name - for male
- Preferred shortetst & longest  name for female
- Search if Ignacio and Raul exist in the list

*** Most common names in Spain from 2017 ***
https://www.donquijote.org/spanish-language/names/#:~:text=While%20our%20grandparents%20are%20called,Daniel%2C%20and%20Pablo%20for%20boys.

- Question here: Check how many names are common in our dataframe from the given list:
   - Most common names - Lucía, Sofía, María, Martina, and Paula for girls
   - Most common names - Lucas, Hugo, Martín, Daniel, and Pablo for boys. 
- New questions:
   - Names per year - make a list as per year - possibility to substract on the base of male & female

## 3.1 Analyse the data set and show most frequent names

###  3.1.1 Show values

In [78]:
baby_name['Name'].value_counts() # figure out how to extract first top ten rows!!!!

POL         21
CARLA       21
SARA        21
ALBA        21
MARIA       21
            ..
PATRICIA     1
CHLOE        1
RAUL         1
GAEL         1
GABRIEL      1
Name: Name, Length: 97, dtype: int64

### 3.1.2 Check of data duplicates

In [79]:


#Recalling all unique names from baby_name
baby_name['Name'].unique()

array(['LAURA', 'MARIA', 'MARTA', 'ANDREA', 'ANNA', 'PAULA', 'ALBA',
       'SARA', 'LAIA', 'CLAUDIA', 'JULIA', 'CARLA', 'MIREIA', 'MARINA',
       'CRISTINA', 'CLARA', 'JUDITH', 'ARIADNA', 'NURIA', 'PATRICIA',
       'RAQUEL', 'ANA', 'IRENE', 'JUDIT', 'SANDRA', 'BERTA', 'MAR',
       'AINA', 'HELENA', 'NATALIA', 'CARLOTA', 'EMMA', 'NEREA', 'LUCIA',
       'MARTINA', 'AINHOA', 'SOFIA', 'NOA', 'JANA', 'ABRIL', 'DANIELA',
       'INES', 'ONA', 'NORA', 'OLIVIA', 'VALENTINA', 'ARLET', 'MIA',
       'CHLOE', 'VALERIA', 'MARC', 'DAVID', 'DANIEL', 'ALBERT', 'VICTOR',
       'JORDI', 'SERGI', 'ALEJANDRO', 'POL', 'ALEX', 'PAU', 'GUILLEM',
       'CARLOS', 'ORIOL', 'ADRIA', 'ROGER', 'OSCAR', 'JAVIER', 'GERARD',
       'ARNAU', 'IVAN', 'XAVIER', 'JOAN', 'ERIC', 'PABLO', 'ADRIAN',
       'SERGIO', 'JOEL', 'MARTI', 'RAUL', 'JAN', 'ALVARO', 'HUGO', 'IKER',
       'BIEL', 'NICOLAS', 'BRUNO', 'LUCAS', 'MAX', 'NIL', 'ALEIX', 'LEO',
       'MATEO', 'MARIO', 'ROC', 'GAEL', 'GABRIEL'], dtype=object)

### 3.1.3 Check frequency of gender names

In [80]:
Babynames = baby_name.loc[:,'Gender':'Frequency']
print(Babynames.head(4))

   Gender  Year  Frequency
0  Female  1996        237
1  Female  1996        219
2  Female  1996        206
3  Female  1996        199

### 3.1.4 Sort gender names and frequency descending

In [81]:

baby_name.sort_values(by='Frequency',ascending = False)

      Order     Name  Gender  Year  Frequency
550       1     MARC    Male  1997        348
575       1     MARC    Male  1998        330
75        1    MARIA  Female  1999        299
525       1     MARC    Male  1996        295
600       1     MARC    Male  1999        291
...     ...      ...     ...   ...        ...
999      25  GUILLEM    Male  2014         47
974      25    MARIO    Male  2013         46
499      25  ARIADNA  Female  2015         45
1048     24  GABRIEL    Male  2016         44
1049     25    ROGER    Male  2016         44

[1050 rows x 5 columns]

### 3.1.5 Print the most frequent female names

In [82]:
Female = baby_name_new[baby_name_new['Gender']=='Female']
print(Female)

     Order     Name  Gender  Year  Frequency
0        1    LAURA  Female  1996        237
1        2    MARIA  Female  1996        219
2        3    MARTA  Female  1996        206
3        4   ANDREA  Female  1996        199
4        5     ANNA  Female  1996        195
..     ...      ...     ...   ...        ...
520     21     SARA  Female  2016         57
521     22  ARIADNA  Female  2016         55
522     23  DANIELA  Female  2016         55
523     24  VALERIA  Female  2016         55
524     25    ARLET  Female  2016         54

[525 rows x 5 columns]

### 3.1.6 List only the unique female names

In [83]:
unique_Female = Female['Name'].unique()
print(unique_Female)

['LAURA' 'MARIA' 'MARTA' 'ANDREA' 'ANNA' 'PAULA' 'ALBA' 'SARA' 'LAIA'
 'CLAUDIA' 'JULIA' 'CARLA' 'MIREIA' 'MARINA' 'CRISTINA' 'CLARA' 'JUDITH'
 'ARIADNA' 'NURIA' 'PATRICIA' 'RAQUEL' 'ANA' 'IRENE' 'JUDIT' 'SANDRA'
 'BERTA' 'MAR' 'AINA' 'HELENA' 'NATALIA' 'CARLOTA' 'EMMA' 'NEREA' 'LUCIA'
 'MARTINA' 'AINHOA' 'SOFIA' 'NOA' 'JANA' 'ABRIL' 'DANIELA' 'INES' 'ONA'
 'NORA' 'OLIVIA' 'VALENTINA' 'ARLET' 'MIA' 'CHLOE' 'VALERIA']

In [84]:
sum_female = []
for nom in unique_Female:
    sum_female.append(baby_name[baby_name["Name"] == nom]['Frequency'].sum())
print(sum_female)

[2339, 3843, 1942, 1590, 1950, 3166, 2107, 1924, 3094, 2210, 2976, 2621, 957, 1187, 752, 1208, 268, 1556, 642, 71, 136, 419, 791, 197, 240, 1215, 553, 1368, 123, 122, 602, 1084, 237, 1996, 1991, 113, 1141, 944, 662, 400, 364, 109, 437, 166, 375, 412, 210, 122, 62, 55]

### 3.1.7 List descending only frequencies of unique female names

In [85]:
# Figuring out all frequencies of Female Names appearing in data:
top10f = pd.DataFrame({'Names':unique_Female, 'Frequency':sum_female})
newtt= top10f.sort_values(by='Frequency',ascending = False)
newtt.index = list(range(1,51))
newtt.head(10)

      Names  Frequency
1     MARIA       3843
2     PAULA       3166
3      LAIA       3094
4     JULIA       2976
5     CARLA       2621
6     LAURA       2339
7   CLAUDIA       2210
8      ALBA       2107
9     LUCIA       1996
10  MARTINA       1991

### 3.1.8 List the 10 most frequent male names

In [86]:
# This was our question:
# Selection of top 10 most appearing male names in the data:
Male = baby_name_new[baby_name_new['Gender']=='Male']
print(Male)

      Order     Name Gender  Year  Frequency
525       1     MARC   Male  1996        295
526       2    DAVID   Male  1996        198
527       3   DANIEL   Male  1996        174
528       4   ALBERT   Male  1996        151
529       5   VICTOR   Male  1996        145
...     ...      ...    ...   ...        ...
1045     21   GERARD   Male  2016         57
1046     22    ADRIA   Male  2016         51
1047     23      ROC   Male  2016         48
1048     24  GABRIEL   Male  2016         44
1049     25    ROGER   Male  2016         44

[525 rows x 5 columns]

### 3.1.9 List only the unique male names

In [87]:
unique_Male = Male['Name'].unique()
print(unique_Male)

['MARC' 'DAVID' 'DANIEL' 'ALBERT' 'VICTOR' 'JORDI' 'SERGI' 'ALEJANDRO'
 'POL' 'ALEX' 'PAU' 'GUILLEM' 'CARLOS' 'ORIOL' 'ADRIA' 'ROGER' 'OSCAR'
 'JAVIER' 'GERARD' 'ARNAU' 'IVAN' 'XAVIER' 'JOAN' 'ERIC' 'PABLO' 'ADRIAN'
 'SERGIO' 'JOEL' 'MARTI' 'RAUL' 'JAN' 'ALVARO' 'HUGO' 'IKER' 'BIEL'
 'NICOLAS' 'BRUNO' 'LUCAS' 'MAX' 'NIL' 'ALEIX' 'LEO' 'MATEO' 'MARIO' 'ROC'
 'GAEL' 'GABRIEL']

### 3.1.10 List descending only frequencies of unique male names

In [88]:
sum_male = []
for nom in unique_Male:
    sum_male.append(baby_name[baby_name["Name"] == nom]['Frequency'].sum())
sum_male
top10m = pd.DataFrame({'Frequencym':sum_male,'Names':unique_Male, })
newttt= top10m.sort_values(by='Frequencym',ascending = False)
newttt.index = list(range(1,48))
newttt.head(10)

    Frequencym   Names
1         5079    MARC
2         3223    ALEX
3         3131     POL
4         2909     PAU
5         2618  DANIEL
6         2544   DAVID
7         2182   ARNAU
8         2082    ERIC
9         2010  VICTOR
10        1738  GERARD

### 3.1.11 Combine output of female and male results and list the top 10 most unique names in the data

In [89]:
# This was our question:
# Selection of top 10 most appearing male names in the data:
result = pd.concat([newtt, newttt], axis=1, join="inner")
result.head(10)

      Names  Frequency  Frequencym   Names
1     MARIA       3843        5079    MARC
2     PAULA       3166        3223    ALEX
3      LAIA       3094        3131     POL
4     JULIA       2976        2909     PAU
5     CARLA       2621        2618  DANIEL
6     LAURA       2339        2544   DAVID
7   CLAUDIA       2210        2182   ARNAU
8      ALBA       2107        2082    ERIC
9     LUCIA       1996        2010  VICTOR
10  MARTINA       1991        1738  GERARD

## 3.2.1 Compare the difference of frequncies of female and male names

### 3.2.1 Analyse the difference of frequencies for the top used male and female names

In [110]:
diff = result['Frequencym']- result['Frequency']
#diff.head(100)
difference = diff.to_frame()
colname = ['Freq_Diff']
difference.columns = colname
difference
#hypothesis:?

    Freq_Diff
1        1236
2          57
3          37
4         -67
5          -3
6         205
7         -28
8         -25
9          14
10       -253
11       -230
12       -360
13       -370
14        -58
15       -118
16         45
17         89
18         89
19        -55
20        -10
21        -83
22          8
23        -48
24         90
25         47
26          3
27         15
28         54
29         12
30        128
31        116
32        120
33        129
34        102
35         82
36        123
37        128
38         13
39         28
40        -57
41        -40
42        -31
43        -58
44        -58
45        -58
46        -67
47        -65

### 3.2.2 Combine the result to the table with the most frequent used male and female names

In [111]:
difference = pd.concat([result, difference], axis=1, join="inner")
difference.head()

   Names  Frequency  Frequencym   Names  Freq_Diff
1  MARIA       3843        5079    MARC       1236
2  PAULA       3166        3223    ALEX         57
3   LAIA       3094        3131     POL         37
4  JULIA       2976        2909     PAU        -67
5  CARLA       2621        2618  DANIEL         -3

In [112]:
#difference['Pct_change'] = difference.pct_change(difference['Freq_F'],difference['Freq_M']).reset_index(drop=True)   
#difference

difference['Pct_change'] = ((difference['Frequencym'] - difference['Frequency'])/ difference['Frequencym']) * 100

#(5079-3843)/5079*100
difference.head(10)

      Names  Frequency  Frequencym   Names  Freq_Diff  Pct_change
1     MARIA       3843        5079    MARC       1236   24.335499
2     PAULA       3166        3223    ALEX         57    1.768539
3      LAIA       3094        3131     POL         37    1.181731
4     JULIA       2976        2909     PAU        -67   -2.303197
5     CARLA       2621        2618  DANIEL         -3   -0.114591
6     LAURA       2339        2544   DAVID        205    8.058176
7   CLAUDIA       2210        2182   ARNAU        -28   -1.283226
8      ALBA       2107        2082    ERIC        -25   -1.200768
9     LUCIA       1996        2010  VICTOR         14    0.696517
10  MARTINA       1991        1738  GERARD       -253  -14.556962

In [93]:
yearz = []
for i in Female['Year'].unique():
    yearz.append(Female[['Name','Frequency','Year']][Female["Year"] == i].head(3))

yearz
top3 = pd.concat(yearz)
top3.index = list(range(1,64))
top3.head(63)

     Name  Frequency  Year
1   LAURA        237  1996
2   MARIA        219  1996
3   MARTA        206  1996
4   MARIA        241  1997
5   LAURA        229  1997
..    ...        ...   ...
59  JULIA        123  2015
60  LUCIA        120  2015
61  JULIA        137  2016
62   LAIA        129  2016
63  LUCIA        122  2016

[63 rows x 3 columns]

## 3.3 Analyse the names if they are international or local

### 3.3.1 List the top 3 names from each year and check whether these are local or international names

In [94]:
# Top 3 female names for each year 
# question in question : # checking online if name from dataframe is local or international:

# hypothesis: total frequency of international (from checked list from internet (behindthename)):
  # only one Name with X

nationalityf = []
#top3["nationalityf"] = 0
for nom in top3["Name"]:
#for i in range(1, len(top3['Name']) + 1):
    if nom in ['LAURA','MARIA','MARTA','PAULA', 'CARLA', 'LAIA', 'JULIA', 'MARTINA',"EMMA"]:
    #if top3["Name"][i] in ['LAURA','MARIA','MARTA','PAULA', 'CARLA', 'LAIA', 'JULIA', 'MARTINA',"EMMA"]:
        nationalityf.append('national')
        #top3["nationalityf"][i] = "national"
    else:
        nationalityf.append('international')
        #top3["nationality"][i] = "international"
top3["nationality"] = nationalityf
top3

     Name  Frequency  Year    nationality
1   LAURA        237  1996       national
2   MARIA        219  1996       national
3   MARTA        206  1996       national
4   MARIA        241  1997       national
5   LAURA        229  1997       national
..    ...        ...   ...            ...
59  JULIA        123  2015       national
60  LUCIA        120  2015  international
61  JULIA        137  2016       national
62   LAIA        129  2016       national
63  LUCIA        122  2016  international

[63 rows x 4 columns]

In [95]:
top3['Name'].unique()
top3_list = list(top3['Name'].unique())
print(top3_list)

['LAURA', 'MARIA', 'MARTA', 'PAULA', 'CARLA', 'LAIA', 'JULIA', 'LUCIA', 'MARTINA', 'EMMA']

In [96]:
yearzm = []
for i in Male['Year'].unique():
    yearzm.append(Male[['Name','Frequency','Year']][Male["Year"] == i].head(3))

yearzm
top3m = pd.concat(yearzm)
top3m.index = list(range(1,64))
top3m.head(63)

      Name  Frequency  Year
1     MARC        295  1996
2    DAVID        198  1996
3   DANIEL        174  1996
4     MARC        348  1997
5    DAVID        183  1997
..     ...        ...   ...
59   MARTI        133  2015
60    ALEX        110  2015
61    MARC        148  2016
62    ALEX        140  2016
63     POL        110  2016

[63 rows x 3 columns]

In [97]:
#Top 3 male names each year
nationalitym = []
#top3["nationalitym"] = 0
for nom in top3m["Name"]:
#for i in range(1, len(top3['Name']) + 1):
    if nom in ['MARC','DAVID','DANIEL','POL','PAN','ERIC','MARTI']:
        nationalitym.append('national')
        #top3["nationalityf"][i] = "national"
    else:
        nationalitym.append('international')
        #top3["nationality"][i] = "international"
top3m["nationality"] = nationalitym
top3m

      Name  Frequency  Year    nationality
1     MARC        295  1996       national
2    DAVID        198  1996       national
3   DANIEL        174  1996       national
4     MARC        348  1997       national
5    DAVID        183  1997       national
..     ...        ...   ...            ...
59   MARTI        133  2015       national
60    ALEX        110  2015  international
61    MARC        148  2016       national
62    ALEX        140  2016  international
63     POL        110  2016       national

[63 rows x 4 columns]

## 3.4 Analyse the preferred short & long name

### 3.4.1 Analyse the preferred short & long names for female and male

In [98]:
shortest_female_name = min(unique_Female, key=len)
print(shortest_female_name,"Length" ,len(shortest_female_name) )

ANA Length 3

In [99]:
longest_female_name = max(unique_Female,key = len)
longest_female_name
print(longest_female_name,"Length" ,len(longest_female_name) )

VALENTINA Length 9

In [100]:
shortest_male_name = min(unique_Male,key=len)
shortest_male_name
print(shortest_male_name,"Length" ,len(shortest_male_name) )

POL Length 3

In [101]:
shortest_male_name = max(unique_Male,key=len)
shortest_male_name
print(shortest_male_name,"Length" ,len(shortest_male_name) )

ALEJANDRO Length 9

In [102]:
baby_name_unique = list(baby_name['Name'].unique())

In [103]:
df = list(baby_name['Name'].unique())

sorted_list =sorted(df)
print(sorted_list)

# Most of them are appearing with "A". We look at this webpage:
# We consider that it is most common to have a name starting with :
# https://www.bounty.com/pregnancy-and-birth/baby-names/baby-name-search/x
# We figure out that the most general names in the world starting with "A"

['ABRIL', 'ADRIA', 'ADRIAN', 'AINA', 'AINHOA', 'ALBA', 'ALBERT', 'ALEIX', 'ALEJANDRO', 'ALEX', 'ALVARO', 'ANA', 'ANDREA', 'ANNA', 'ARIADNA', 'ARLET', 'ARNAU', 'BERTA', 'BIEL', 'BRUNO', 'CARLA', 'CARLOS', 'CARLOTA', 'CHLOE', 'CLARA', 'CLAUDIA', 'CRISTINA', 'DANIEL', 'DANIELA', 'DAVID', 'EMMA', 'ERIC', 'GABRIEL', 'GAEL', 'GERARD', 'GUILLEM', 'HELENA', 'HUGO', 'IKER', 'INES', 'IRENE', 'IVAN', 'JAN', 'JANA', 'JAVIER', 'JOAN', 'JOEL', 'JORDI', 'JUDIT', 'JUDITH', 'JULIA', 'LAIA', 'LAURA', 'LEO', 'LUCAS', 'LUCIA', 'MAR', 'MARC', 'MARIA', 'MARINA', 'MARIO', 'MARTA', 'MARTI', 'MARTINA', 'MATEO', 'MAX', 'MIA', 'MIREIA', 'NATALIA', 'NEREA', 'NICOLAS', 'NIL', 'NOA', 'NORA', 'NURIA', 'OLIVIA', 'ONA', 'ORIOL', 'OSCAR', 'PABLO', 'PATRICIA', 'PAU', 'PAULA', 'POL', 'RAQUEL', 'RAUL', 'ROC', 'ROGER', 'SANDRA', 'SARA', 'SERGI', 'SERGIO', 'SOFIA', 'VALENTINA', 'VALERIA', 'VICTOR', 'XAVIER']

### 3.4.2 Bonus question: Analyse the names starting with A, D and E

In [104]:
# Just for fun purpose: 
# name starting with A, D , E
alpha = ["A", "D", "E"]

name_alpha = [name for name in sorted_list if name.startswith(('A','D','E'))]

print(name_alpha)

['ABRIL', 'ADRIA', 'ADRIAN', 'AINA', 'AINHOA', 'ALBA', 'ALBERT', 'ALEIX', 'ALEJANDRO', 'ALEX', 'ALVARO', 'ANA', 'ANDREA', 'ANNA', 'ARIADNA', 'ARLET', 'ARNAU', 'DANIEL', 'DANIELA', 'DAVID', 'EMMA', 'ERIC']

In [105]:
len(name_alpha)

22

## 3.5 Check if familiar names (Class mate's names) are part of the data set

### 3.5.1 Check whether our Spanish classmate's name are in the data set

In [106]:

# to check if following names are in df:

class_name = ["Ignacio", "Raul", "Emmanuelle", "Laura"]
#print(sorted_list)
check = [(name, name.upper() in  sorted_list) for name in class_name]

print(check)

for tup in check:
    if ( tup[1] == True ):
        print("Yes, the name {} is in new_list".format(tup[0])) 
    else:
        print("No, the name {} is not in new_list".format(tup[0]))

[('Ignacio', False), ('Raul', True), ('Emmanuelle', False), ('Laura', True)]
No, the name Ignacio is not in new_list
Yes, the name Raul is in new_list
No, the name Emmanuelle is not in new_list
Yes, the name Laura is in new_list

## 3.6 Analyse the data set and the % share of female and male names in the given data set

### 3.6.1 Analyse the given data set using describe function

In [107]:
#- To compare % share of male & female data from given dataset:

baby_name.describe()

             Order         Year    Frequency
count  1050.000000  1050.000000  1050.000000
mean     13.000000  2006.000000   101.655238
std       7.214539     6.058186    44.339052
min       1.000000  1996.000000    44.000000
25%       7.000000  2001.000000    69.000000
50%      13.000000  2006.000000    89.000000
75%      19.000000  2011.000000   122.000000
max      25.000000  2016.000000   348.000000

### 3.6.2 Analyse the given data set only for females

In [108]:
Female.describe()

           Order         Year   Frequency
count  525.00000   525.000000  525.000000
mean    13.00000  2006.000000  101.045714
std      7.21798     6.061076   44.483312
min      1.00000  1996.000000   45.000000
25%      7.00000  2001.000000   66.000000
50%     13.00000  2006.000000   87.000000
75%     19.00000  2011.000000  125.000000
max     25.00000  2016.000000  299.000000

### 3.6.3 Analyse the given data set only for males

In [109]:
Male.describe()

           Order         Year   Frequency
count  525.00000   525.000000  525.000000
mean    13.00000  2006.000000  102.264762
std      7.21798     6.061076   44.228333
min      1.00000  1996.000000   44.000000
25%      7.00000  2001.000000   73.000000
50%     13.00000  2006.000000   90.000000
75%     19.00000  2011.000000  118.000000
max     25.00000  2016.000000  348.000000

[Go to the start of the page](#start_of_the_page)

<a style='text-decoration:none;line-height:16px;display:flex;color:#5B5B62;padding:10px;justify-content:end;' href='https://deepnote.com?utm_source=created-in-deepnote-cell&projectId=b6f24320-606f-4f9e-ad26-95b385f7688f' target="_blank">
<img alt='Created in deepnote.com' style='display:inline;max-height:16px;margin:0px;margin-right:7.5px;' src='' > </img>
Created in <span style='font-weight:600;margin-left:4px;'>Deepnote</span></a>